MikroElektronika/core_packages/PIC/XC8/def/PIC18F84J90/mcu.h
extern volatile LCDDATA9bits_t LCDDATA9bits __at(0xF6F);
// bitfield macros
#define _LCDDATA9_LCDDATA9_POSN                             0x0
#define _LCDDATA9_LCDDATA9_POSITION                         0x0
#define _LCDDATA9_LCDDATA9_SIZE                             0x8
#define _LCDDATA9_LCDDATA9_LENGTH                           0x8
#define _LCDDATA9_LCDDATA9_MASK                             0xFF
#define _LCDDATA9_S24C1_POSN                                0x0
#define _LCDDATA9_S24C1_POSITION                            0x0
#define _LCDDATA9_S24C1_SIZE                                0x1
#define _LCDDATA9_S24C1_LENGTH                              0x1
#define _LCDDATA9_S24C1_MASK                                0x1
#define _LCDDATA9_S25C1_POSN                                0x1
#define _LCDDATA9_S25C1_POSITION                            0x1
#define _LCDDATA9_S25C1_SIZE                                0x1
#define _LCDDATA9_S25C1_LENGTH                              0x1
#define _LCDDATA9_S25C1_MASK                                0x2
#define _LCDDATA9_S26C1_POSN                                0x2
#define _LCDDATA9_S26C1_POSITION                            0x2
#define _LCDDATA9_S26C1_SIZE                                0x1
#define _LCDDATA9_S26C1_LENGTH                              0x1
#define _LCDDATA9_S26C1_MASK                                0x4
#define _LCDDATA9_S27C1_POSN                                0x3
#define _LCDDATA9_S27C1_POSITION                            0x3
#define _LCDDATA9_S27C1_SIZE                                0x1
#define _LCDDATA9_S27C1_LENGTH                              0x1
#define _LCDDATA9_S27C1_MASK                                0x8
#define _LCDDATA9_S28C1_POSN                                0x4
#define _LCDDATA9_S28C1_POSITION                            0x4
#define _LCDDATA9_S28C1_SIZE                                0x1
#define _LCDDATA9_S28C1_LENGTH                              0x1
#define _LCDDATA9_S28C1_MASK                                0x10
#define _LCDDATA9_S29C1_POSN                                0x5
#define _LCDDATA9_S29C1_POSITION                            0x5
#define _LCDDATA9_S29C1_SIZE                                0x1
#define _LCDDATA9_S29C1_LENGTH                              0x1
#define _LCDDATA9_S29C1_MASK                                0x20
#define _LCDDATA9_S30C1_POSN                                0x6
#define _LCDDATA9_S30C1_POSITION                            0x6
#define _LCDDATA9_S30C1_SIZE                                0x1
#define _LCDDATA9_S30C1_LENGTH                              0x1
#define _LCDDATA9_S30C1_MASK                                0x40
#define _LCDDATA9_S31C1_POSN                                0x7
#define _LCDDATA9_S31C1_POSITION                            0x7
#define _LCDDATA9_S31C1_SIZE                                0x1
#define _LCDDATA9_S31C1_LENGTH                              0x1
#define _LCDDATA9_S31C1_MASK                                0x80
#define _LCDDATA9_SEG24COM1_POSN                            0x0
#define _LCDDATA9_SEG24COM1_POSITION                        0x0
#define _LCDDATA9_SEG24COM1_SIZE                            0x1
#define _LCDDATA9_SEG24COM1_LENGTH                          0x1
#define _LCDDATA9_SEG24COM1_MASK                            0x1
#define _LCDDATA9_SEG25COM1_POSN                            0x1
#define _LCDDATA9_SEG25COM1_POSITION                        0x1
#define _LCDDATA9_SEG25COM1_SIZE                            0x1
#define _LCDDATA9_SEG25COM1_LENGTH                          0x1
#define _LCDDATA9_SEG25COM1_MASK                            0x2
#define _LCDDATA9_SEG26COM1_POSN                            0x2
#define _LCDDATA9_SEG26COM1_POSITION                        0x2
#define _LCDDATA9_SEG26COM1_SIZE                            0x1
#define _LCDDATA9_SEG26COM1_LENGTH                          0x1
#define _LCDDATA9_SEG26COM1_MASK                            0x4
#define _LCDDATA9_SEG27COM1_POSN                            0x3
#define _LCDDATA9_SEG27COM1_POSITION                        0x3
#define _LCDDATA9_SEG27COM1_SIZE                            0x1
#define _LCDDATA9_SEG27COM1_LENGTH                          0x1
#define _LCDDATA9_SEG27COM1_MASK                            0x8
#define _LCDDATA9_SEG28COM1_POSN                            0x4
#define _LCDDATA9_SEG28COM1_POSITION                        0x4
#define _LCDDATA9_SEG28COM1_SIZE                            0x1
#define _LCDDATA9_SEG28COM1_LENGTH                          0x1
#define _LCDDATA9_SEG28COM1_MASK                            0x10
#define _LCDDATA9_SEG29COM1_POSN                            0x5
#define _LCDDATA9_SEG29COM1_POSITION                        0x5
#define _LCDDATA9_SEG29COM1_SIZE                            0x1
#define _LCDDATA9_SEG29COM1_LENGTH                          0x1
#define _LCDDATA9_SEG29COM1_MASK                            0x20
#define _LCDDATA9_SEG30COM1_POSN                            0x6
#define _LCDDATA9_SEG30COM1_POSITION                        0x6
#define _LCDDATA9_SEG30COM1_SIZE                            0x1
#define _LCDDATA9_SEG30COM1_LENGTH                          0x1
#define _LCDDATA9_SEG30COM1_MASK                            0x40
#define _LCDDATA9_SEG31COM1_POSN                            0x7
#define _LCDDATA9_SEG31COM1_POSITION                        0x7
#define _LCDDATA9_SEG31COM1_SIZE                            0x1
#define _LCDDATA9_SEG31COM1_LENGTH                          0x1
#define _LCDDATA9_SEG31COM1_MASK                            0x80

// Register: LCDDATA10
#define LCDDATA10 LCDDATA10
extern volatile unsigned char           LCDDATA10           __at(0xF70);
#ifndef _LIB_BUILD
asm("LCDDATA10 equ 0F70h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA10              :8;
    };
    struct {
        unsigned S32C1                  :1;
        unsigned S33C1                  :1;
        unsigned S34C1                  :1;
        unsigned S35C1                  :1;
        unsigned S36C1                  :1;
        unsigned S37C1                  :1;
        unsigned S38C1                  :1;
        unsigned S39C1                  :1;
    };
    struct {
        unsigned SEG32COM1              :1;
        unsigned SEG33COM1              :1;
        unsigned SEG34COM1              :1;
        unsigned SEG35COM1              :1;
        unsigned SEG36COM1              :1;
        unsigned SEG37COM1              :1;
        unsigned SEG38COM1              :1;
        unsigned SEG39COM1              :1;
    };
} LCDDATA10bits_t;
