MikroElektronika/core_packages/PIC/XC8/def/PIC18F84J90/mcu.h
extern volatile IPR3bits_t IPR3bits __at(0xFA5);
// bitfield macros
#define _IPR3_CCP1IP_POSN                                   0x1
#define _IPR3_CCP1IP_POSITION                               0x1
#define _IPR3_CCP1IP_SIZE                                   0x1
#define _IPR3_CCP1IP_LENGTH                                 0x1
#define _IPR3_CCP1IP_MASK                                   0x2
#define _IPR3_CCP2IP_POSN                                   0x2
#define _IPR3_CCP2IP_POSITION                               0x2
#define _IPR3_CCP2IP_SIZE                                   0x1
#define _IPR3_CCP2IP_LENGTH                                 0x1
#define _IPR3_CCP2IP_MASK                                   0x4
#define _IPR3_TX2IP_POSN                                    0x4
#define _IPR3_TX2IP_POSITION                                0x4
#define _IPR3_TX2IP_SIZE                                    0x1
#define _IPR3_TX2IP_LENGTH                                  0x1
#define _IPR3_TX2IP_MASK                                    0x10
#define _IPR3_RC2IP_POSN                                    0x5
#define _IPR3_RC2IP_POSITION                                0x5
#define _IPR3_RC2IP_SIZE                                    0x1
#define _IPR3_RC2IP_LENGTH                                  0x1
#define _IPR3_RC2IP_MASK                                    0x20
#define _IPR3_LCDIP_POSN                                    0x6
#define _IPR3_LCDIP_POSITION                                0x6
#define _IPR3_LCDIP_SIZE                                    0x1
#define _IPR3_LCDIP_LENGTH                                  0x1
#define _IPR3_LCDIP_MASK                                    0x40
#define _IPR3_RXBNIP_POSN                                   0x1
#define _IPR3_RXBNIP_POSITION                               0x1
#define _IPR3_RXBNIP_SIZE                                   0x1
#define _IPR3_RXBNIP_LENGTH                                 0x1
#define _IPR3_RXBNIP_MASK                                   0x2
#define _IPR3_TXBNIP_POSN                                   0x4
#define _IPR3_TXBNIP_POSITION                               0x4
#define _IPR3_TXBNIP_SIZE                                   0x1
#define _IPR3_TXBNIP_LENGTH                                 0x1
#define _IPR3_TXBNIP_MASK                                   0x10

// Register: EECON1
#define EECON1 EECON1
extern volatile unsigned char           EECON1              __at(0xFA6);
#ifndef _LIB_BUILD
asm("EECON1 equ 0FA6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned WR                     :1;
        unsigned WREN                   :1;
        unsigned WRERR                  :1;
        unsigned FREE                   :1;
    };
} EECON1bits_t;
extern volatile EECON1bits_t EECON1bits __at(0xFA6);
// bitfield macros
#define _EECON1_WR_POSN                                     0x1
#define _EECON1_WR_POSITION                                 0x1
#define _EECON1_WR_SIZE                                     0x1
#define _EECON1_WR_LENGTH                                   0x1
#define _EECON1_WR_MASK                                     0x2
#define _EECON1_WREN_POSN                                   0x2
#define _EECON1_WREN_POSITION                               0x2
#define _EECON1_WREN_SIZE                                   0x1
#define _EECON1_WREN_LENGTH                                 0x1
#define _EECON1_WREN_MASK                                   0x4
#define _EECON1_WRERR_POSN                                  0x3
#define _EECON1_WRERR_POSITION                              0x3
#define _EECON1_WRERR_SIZE                                  0x1
#define _EECON1_WRERR_LENGTH                                0x1
#define _EECON1_WRERR_MASK                                  0x8
#define _EECON1_FREE_POSN                                   0x4
#define _EECON1_FREE_POSITION                               0x4
#define _EECON1_FREE_SIZE                                   0x1
#define _EECON1_FREE_LENGTH                                 0x1
#define _EECON1_FREE_MASK                                   0x10

// Register: EECON2
#define EECON2 EECON2
extern volatile unsigned char           EECON2              __at(0xFA7);
#ifndef _LIB_BUILD
asm("EECON2 equ 0FA7h");
#endif

// Register: LCDCON
#define LCDCON LCDCON
extern volatile unsigned char           LCDCON              __at(0xFA8);
#ifndef _LIB_BUILD
asm("LCDCON equ 0FA8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LMUX                   :2;
        unsigned CS                     :2;
        unsigned                        :1;
        unsigned WERR                   :1;
        unsigned SLPEN                  :1;
        unsigned LCDEN                  :1;
    };
    struct {
        unsigned LMUX0                  :1;
        unsigned LMUX1                  :1;
        unsigned LCDCS0                 :1;
        unsigned LCDCS1                 :1;
        unsigned                        :1;
        unsigned LCDWERR                :1;
        unsigned LCDSLPEN               :1;
    };
    struct {
        unsigned                        :2;
        unsigned CS0                    :1;
        unsigned CS1                    :1;
    };
} LCDCONbits_t;
extern volatile LCDCONbits_t LCDCONbits __at(0xFA8);
// bitfield macros
#define _LCDCON_LMUX_POSN                                   0x0
#define _LCDCON_LMUX_POSITION                               0x0
#define _LCDCON_LMUX_SIZE                                   0x2
#define _LCDCON_LMUX_LENGTH                                 0x2
#define _LCDCON_LMUX_MASK                                   0x3
#define _LCDCON_CS_POSN                                     0x2
#define _LCDCON_CS_POSITION                                 0x2
#define _LCDCON_CS_SIZE                                     0x2
#define _LCDCON_CS_LENGTH                                   0x2
#define _LCDCON_CS_MASK                                     0xC
#define _LCDCON_WERR_POSN                                   0x5
#define _LCDCON_WERR_POSITION                               0x5
#define _LCDCON_WERR_SIZE                                   0x1
#define _LCDCON_WERR_LENGTH                                 0x1
#define _LCDCON_WERR_MASK                                   0x20
#define _LCDCON_SLPEN_POSN                                  0x6
#define _LCDCON_SLPEN_POSITION                              0x6
#define _LCDCON_SLPEN_SIZE                                  0x1
#define _LCDCON_SLPEN_LENGTH                                0x1
#define _LCDCON_SLPEN_MASK                                  0x40
#define _LCDCON_LCDEN_POSN                                  0x7
#define _LCDCON_LCDEN_POSITION                              0x7
#define _LCDCON_LCDEN_SIZE                                  0x1
#define _LCDCON_LCDEN_LENGTH                                0x1
#define _LCDCON_LCDEN_MASK                                  0x80
#define _LCDCON_LMUX0_POSN                                  0x0
#define _LCDCON_LMUX0_POSITION                              0x0
#define _LCDCON_LMUX0_SIZE                                  0x1
#define _LCDCON_LMUX0_LENGTH                                0x1
#define _LCDCON_LMUX0_MASK                                  0x1
#define _LCDCON_LMUX1_POSN                                  0x1
#define _LCDCON_LMUX1_POSITION                              0x1
#define _LCDCON_LMUX1_SIZE                                  0x1
#define _LCDCON_LMUX1_LENGTH                                0x1
#define _LCDCON_LMUX1_MASK                                  0x2
#define _LCDCON_LCDCS0_POSN                                 0x2
#define _LCDCON_LCDCS0_POSITION                             0x2
#define _LCDCON_LCDCS0_SIZE                                 0x1
#define _LCDCON_LCDCS0_LENGTH                               0x1
#define _LCDCON_LCDCS0_MASK                                 0x4
#define _LCDCON_LCDCS1_POSN                                 0x3
#define _LCDCON_LCDCS1_POSITION                             0x3
#define _LCDCON_LCDCS1_SIZE                                 0x1
#define _LCDCON_LCDCS1_LENGTH                               0x1
#define _LCDCON_LCDCS1_MASK                                 0x8
#define _LCDCON_LCDWERR_POSN                                0x5
#define _LCDCON_LCDWERR_POSITION                            0x5
#define _LCDCON_LCDWERR_SIZE                                0x1
#define _LCDCON_LCDWERR_LENGTH                              0x1
#define _LCDCON_LCDWERR_MASK                                0x20
#define _LCDCON_LCDSLPEN_POSN                               0x6
#define _LCDCON_LCDSLPEN_POSITION                           0x6
#define _LCDCON_LCDSLPEN_SIZE                               0x1
#define _LCDCON_LCDSLPEN_LENGTH                             0x1
#define _LCDCON_LCDSLPEN_MASK                               0x40
#define _LCDCON_CS0_POSN                                    0x2
#define _LCDCON_CS0_POSITION                                0x2
#define _LCDCON_CS0_SIZE                                    0x1
#define _LCDCON_CS0_LENGTH                                  0x1
#define _LCDCON_CS0_MASK                                    0x4
#define _LCDCON_CS1_POSN                                    0x3
#define _LCDCON_CS1_POSITION                                0x3
#define _LCDCON_CS1_SIZE                                    0x1
#define _LCDCON_CS1_LENGTH                                  0x1
#define _LCDCON_CS1_MASK                                    0x8

// Register: LCDSE0
#define LCDSE0 LCDSE0
extern volatile unsigned char           LCDSE0              __at(0xFA9);
#ifndef _LIB_BUILD
asm("LCDSE0 equ 0FA9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDSE0                 :8;
    };
    struct {
        unsigned SE0                    :1;
        unsigned SE1                    :1;
        unsigned SE2                    :1;
        unsigned SE3                    :1;
        unsigned SE4                    :1;
        unsigned SE5                    :1;
        unsigned SE6                    :1;
        unsigned SE7                    :1;
    };
    struct {
        unsigned SEGEN0                 :1;
        unsigned SEGEN1                 :1;
        unsigned SEGEN2                 :1;
        unsigned SEGEN3                 :1;
        unsigned SEGEN4                 :1;
        unsigned SEGEN5                 :1;
        unsigned SEGEN6                 :1;
        unsigned SEGEN7                 :1;
    };
    struct {
        unsigned SE00                   :1;
        unsigned SE01                   :1;
        unsigned SE02                   :1;
        unsigned SE03                   :1;
        unsigned SE04                   :1;
        unsigned SE05                   :1;
        unsigned SE06                   :1;
        unsigned SE07                   :1;
    };
} LCDSE0bits_t;
extern volatile LCDSE0bits_t LCDSE0bits __at(0xFA9);
// bitfield macros
#define _LCDSE0_LCDSE0_POSN                                 0x0
#define _LCDSE0_LCDSE0_POSITION                             0x0
#define _LCDSE0_LCDSE0_SIZE                                 0x8
#define _LCDSE0_LCDSE0_LENGTH                               0x8
#define _LCDSE0_LCDSE0_MASK                                 0xFF
#define _LCDSE0_SE0_POSN                                    0x0
#define _LCDSE0_SE0_POSITION                                0x0
#define _LCDSE0_SE0_SIZE                                    0x1
#define _LCDSE0_SE0_LENGTH                                  0x1
#define _LCDSE0_SE0_MASK                                    0x1
#define _LCDSE0_SE1_POSN                                    0x1
#define _LCDSE0_SE1_POSITION                                0x1
#define _LCDSE0_SE1_SIZE                                    0x1
#define _LCDSE0_SE1_LENGTH                                  0x1
#define _LCDSE0_SE1_MASK                                    0x2
#define _LCDSE0_SE2_POSN                                    0x2
#define _LCDSE0_SE2_POSITION                                0x2
#define _LCDSE0_SE2_SIZE                                    0x1
#define _LCDSE0_SE2_LENGTH                                  0x1
#define _LCDSE0_SE2_MASK                                    0x4
#define _LCDSE0_SE3_POSN                                    0x3
#define _LCDSE0_SE3_POSITION                                0x3
#define _LCDSE0_SE3_SIZE                                    0x1
#define _LCDSE0_SE3_LENGTH                                  0x1
#define _LCDSE0_SE3_MASK                                    0x8
#define _LCDSE0_SE4_POSN                                    0x4
#define _LCDSE0_SE4_POSITION                                0x4
#define _LCDSE0_SE4_SIZE                                    0x1
#define _LCDSE0_SE4_LENGTH                                  0x1
#define _LCDSE0_SE4_MASK                                    0x10
#define _LCDSE0_SE5_POSN                                    0x5
#define _LCDSE0_SE5_POSITION                                0x5
#define _LCDSE0_SE5_SIZE                                    0x1
#define _LCDSE0_SE5_LENGTH                                  0x1
#define _LCDSE0_SE5_MASK                                    0x20
#define _LCDSE0_SE6_POSN                                    0x6
#define _LCDSE0_SE6_POSITION                                0x6
#define _LCDSE0_SE6_SIZE                                    0x1
#define _LCDSE0_SE6_LENGTH                                  0x1
#define _LCDSE0_SE6_MASK                                    0x40
#define _LCDSE0_SE7_POSN                                    0x7
#define _LCDSE0_SE7_POSITION                                0x7
#define _LCDSE0_SE7_SIZE                                    0x1
#define _LCDSE0_SE7_LENGTH                                  0x1
#define _LCDSE0_SE7_MASK                                    0x80
#define _LCDSE0_SEGEN0_POSN                                 0x0
#define _LCDSE0_SEGEN0_POSITION                             0x0
#define _LCDSE0_SEGEN0_SIZE                                 0x1
#define _LCDSE0_SEGEN0_LENGTH                               0x1
#define _LCDSE0_SEGEN0_MASK                                 0x1
#define _LCDSE0_SEGEN1_POSN                                 0x1
#define _LCDSE0_SEGEN1_POSITION                             0x1
#define _LCDSE0_SEGEN1_SIZE                                 0x1
#define _LCDSE0_SEGEN1_LENGTH                               0x1
#define _LCDSE0_SEGEN1_MASK                                 0x2
#define _LCDSE0_SEGEN2_POSN                                 0x2
#define _LCDSE0_SEGEN2_POSITION                             0x2
#define _LCDSE0_SEGEN2_SIZE                                 0x1
#define _LCDSE0_SEGEN2_LENGTH                               0x1
#define _LCDSE0_SEGEN2_MASK                                 0x4
#define _LCDSE0_SEGEN3_POSN                                 0x3
#define _LCDSE0_SEGEN3_POSITION                             0x3
#define _LCDSE0_SEGEN3_SIZE                                 0x1
#define _LCDSE0_SEGEN3_LENGTH                               0x1
#define _LCDSE0_SEGEN3_MASK                                 0x8
#define _LCDSE0_SEGEN4_POSN                                 0x4
#define _LCDSE0_SEGEN4_POSITION                             0x4
#define _LCDSE0_SEGEN4_SIZE                                 0x1
#define _LCDSE0_SEGEN4_LENGTH                               0x1
#define _LCDSE0_SEGEN4_MASK                                 0x10
#define _LCDSE0_SEGEN5_POSN                                 0x5
#define _LCDSE0_SEGEN5_POSITION                             0x5
#define _LCDSE0_SEGEN5_SIZE                                 0x1
#define _LCDSE0_SEGEN5_LENGTH                               0x1
#define _LCDSE0_SEGEN5_MASK                                 0x20
#define _LCDSE0_SEGEN6_POSN                                 0x6
#define _LCDSE0_SEGEN6_POSITION                             0x6
#define _LCDSE0_SEGEN6_SIZE                                 0x1
#define _LCDSE0_SEGEN6_LENGTH                               0x1
#define _LCDSE0_SEGEN6_MASK                                 0x40
#define _LCDSE0_SEGEN7_POSN                                 0x7
#define _LCDSE0_SEGEN7_POSITION                             0x7
#define _LCDSE0_SEGEN7_SIZE                                 0x1
#define _LCDSE0_SEGEN7_LENGTH                               0x1
#define _LCDSE0_SEGEN7_MASK                                 0x80
#define _LCDSE0_SE00_POSN                                   0x0
#define _LCDSE0_SE00_POSITION                               0x0
#define _LCDSE0_SE00_SIZE                                   0x1
#define _LCDSE0_SE00_LENGTH                                 0x1
#define _LCDSE0_SE00_MASK                                   0x1
#define _LCDSE0_SE01_POSN                                   0x1
#define _LCDSE0_SE01_POSITION                               0x1
#define _LCDSE0_SE01_SIZE                                   0x1
#define _LCDSE0_SE01_LENGTH                                 0x1
#define _LCDSE0_SE01_MASK                                   0x2
#define _LCDSE0_SE02_POSN                                   0x2
#define _LCDSE0_SE02_POSITION                               0x2
#define _LCDSE0_SE02_SIZE                                   0x1
#define _LCDSE0_SE02_LENGTH                                 0x1
#define _LCDSE0_SE02_MASK                                   0x4
#define _LCDSE0_SE03_POSN                                   0x3
#define _LCDSE0_SE03_POSITION                               0x3
#define _LCDSE0_SE03_SIZE                                   0x1
#define _LCDSE0_SE03_LENGTH                                 0x1
#define _LCDSE0_SE03_MASK                                   0x8
#define _LCDSE0_SE04_POSN                                   0x4
#define _LCDSE0_SE04_POSITION                               0x4
#define _LCDSE0_SE04_SIZE                                   0x1
#define _LCDSE0_SE04_LENGTH                                 0x1
#define _LCDSE0_SE04_MASK                                   0x10
#define _LCDSE0_SE05_POSN                                   0x5
#define _LCDSE0_SE05_POSITION                               0x5
#define _LCDSE0_SE05_SIZE                                   0x1
#define _LCDSE0_SE05_LENGTH                                 0x1
#define _LCDSE0_SE05_MASK                                   0x20
#define _LCDSE0_SE06_POSN                                   0x6
#define _LCDSE0_SE06_POSITION                               0x6
#define _LCDSE0_SE06_SIZE                                   0x1
#define _LCDSE0_SE06_LENGTH                                 0x1
#define _LCDSE0_SE06_MASK                                   0x40
#define _LCDSE0_SE07_POSN                                   0x7
#define _LCDSE0_SE07_POSITION                               0x7
#define _LCDSE0_SE07_SIZE                                   0x1
#define _LCDSE0_SE07_LENGTH                                 0x1
#define _LCDSE0_SE07_MASK                                   0x80

// Register: LCDPS
#define LCDPS LCDPS
extern volatile unsigned char           LCDPS               __at(0xFAA);
#ifndef _LIB_BUILD
asm("LCDPS equ 0FAAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LP                     :4;
        unsigned WA                     :1;
        unsigned LCDA                   :1;
        unsigned BIASMD                 :1;
        unsigned WFT                    :1;
    };
    struct {
        unsigned LCDPS0                 :1;
        unsigned LCDPS1                 :1;
        unsigned LCDPS2                 :1;
        unsigned LCDPS3                 :1;
    };
    struct {
        unsigned LP0                    :1;
        unsigned LP1                    :1;
        unsigned LP2                    :1;
        unsigned LP3                    :1;
    };
} LCDPSbits_t;
